; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	infrared0 - mode
	thermograph1 - mode
	image3 - mode
	image2 - mode
	Star2 - direction
	Star0 - direction
	Star1 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Planet5 - direction
	Phenomenon6 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star0)
	(supports instrument1 image3)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon3)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 144)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph1)
	(supports instrument3 image2)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet4)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 132)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 178)
	(supports instrument6 image2)
	(supports instrument6 image3)
	(calibration_target instrument6 Star0)
	(supports instrument7 image2)
	(supports instrument7 image3)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 145)
	(= (data Phenomenon3 infrared0) 249)
	(= (data Planet4 infrared0) 26)
	(= (data Planet5 infrared0) 135)
	(= (data Phenomenon6 infrared0) 45)
	(= (data Phenomenon3 thermograph1) 294)
	(= (data Planet4 thermograph1) 183)
	(= (data Planet5 thermograph1) 2)
	(= (data Phenomenon6 thermograph1) 230)
	(= (data Phenomenon3 image3) 90)
	(= (data Planet4 image3) 181)
	(= (data Planet5 image3) 112)
	(= (data Phenomenon6 image3) 98)
	(= (data Phenomenon3 image2) 63)
	(= (data Planet4 image2) 81)
	(= (data Planet5 image2) 136)
	(= (data Phenomenon6 image2) 239)
	(= (slew_time Star2 Star0) 52.96)
	(= (slew_time Star0 Star2) 52.96)
	(= (slew_time Star2 Star1) 48.98)
	(= (slew_time Star1 Star2) 48.98)
	(= (slew_time Star1 Star0) 22.91)
	(= (slew_time Star0 Star1) 22.91)
	(= (slew_time Phenomenon3 Star0) 5.406)
	(= (slew_time Star0 Phenomenon3) 5.406)
	(= (slew_time Phenomenon3 Star1) 59.66)
	(= (slew_time Star1 Phenomenon3) 59.66)
	(= (slew_time Phenomenon3 Star2) 30.71)
	(= (slew_time Star2 Phenomenon3) 30.71)
	(= (slew_time Planet4 Star0) 7.929)
	(= (slew_time Star0 Planet4) 7.929)
	(= (slew_time Planet4 Star1) 67.11)
	(= (slew_time Star1 Planet4) 67.11)
	(= (slew_time Planet4 Star2) 27.19)
	(= (slew_time Star2 Planet4) 27.19)
	(= (slew_time Planet4 Phenomenon3) 28.22)
	(= (slew_time Phenomenon3 Planet4) 28.22)
	(= (slew_time Planet5 Star0) 3.843)
	(= (slew_time Star0 Planet5) 3.843)
	(= (slew_time Planet5 Star1) 75.81)
	(= (slew_time Star1 Planet5) 75.81)
	(= (slew_time Planet5 Star2) 34.91)
	(= (slew_time Star2 Planet5) 34.91)
	(= (slew_time Planet5 Phenomenon3) 78.26)
	(= (slew_time Phenomenon3 Planet5) 78.26)
	(= (slew_time Planet5 Planet4) 24.55)
	(= (slew_time Planet4 Planet5) 24.55)
	(= (slew_time Phenomenon6 Star0) 69.95)
	(= (slew_time Star0 Phenomenon6) 69.95)
	(= (slew_time Phenomenon6 Star1) 69.52)
	(= (slew_time Star1 Phenomenon6) 69.52)
	(= (slew_time Phenomenon6 Star2) 81.59)
	(= (slew_time Star2 Phenomenon6) 81.59)
	(= (slew_time Phenomenon6 Phenomenon3) 3.471)
	(= (slew_time Phenomenon3 Phenomenon6) 3.471)
	(= (slew_time Phenomenon6 Planet4) 23.25)
	(= (slew_time Planet4 Phenomenon6) 23.25)
	(= (slew_time Phenomenon6 Planet5) 5.619)
	(= (slew_time Planet5 Phenomenon6) 5.619)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Planet5)
	(pointing satellite2 Star1)
	(pointing satellite3 Planet4)
	(have_image Phenomenon3 image3)
	(have_image Planet4 infrared0)
	(have_image Planet5 thermograph1)
	(have_image Phenomenon6 infrared0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 star1 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 178 to 129.02, (fuel-used) from 0 to 48.98
   goals met: 1 of 7
2. (turn_to satellite3 planet4 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet4)
   changed: (fuel satellite3) from 145 to 137.071, (fuel-used) from 48.98 to 56.909
   goals met: 2 of 7
3. (turn_to satellite0 star0 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 144 to 138.594, (fuel-used) from 56.909 to 62.315
   goals met: 2 of 7
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 7
5. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 7
6. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
8. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 2 of 7
9. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 7
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 7
11. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 2 of 7
12. (turn_to satellite0 planet5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 138.594 to 134.751, (fuel-used) from 62.315 to 66.158
   goals met: 3 of 7
13. (turn_to satellite1 star0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 132 to 124.071, (fuel-used) from 66.158 to 74.087
   goals met: 3 of 7
14. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 3 of 7
15. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 124.071 to 116.142, (fuel-used) from 74.087 to 82.016
   goals met: 3 of 7
16. (take_image satellite1 planet4 instrument2 infrared0)
   added: (have_image planet4 infrared0)
   changed: (data_capacity satellite1) from 1000 to 974, (data-stored) from 0 to 26
   goals met: 4 of 7
17. (turn_to satellite0 phenomenon3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon3)
   changed: (fuel satellite0) from 134.751 to 56.491, (fuel-used) from 82.016 to 160.276
   goals met: 3 of 7
18. (take_image satellite0 phenomenon3 instrument1 image3)
   added: (have_image phenomenon3 image3)
   changed: (data_capacity satellite0) from 1000 to 910, (data-stored) from 26 to 116
   goals met: 4 of 7
19. (turn_to satellite0 phenomenon6 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 56.491 to 53.02, (fuel-used) from 160.276 to 163.747
   goals met: 4 of 7
20. (take_image satellite0 phenomenon6 instrument1 infrared0)
   added: (have_image phenomenon6 infrared0)
   changed: (data_capacity satellite0) from 910 to 865, (data-stored) from 116 to 161
   goals met: 5 of 7
21. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 53.02 to 47.401, (fuel-used) from 163.747 to 169.366
   goals met: 6 of 7
22. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 7
23. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 7
24. (turn_to satellite0 star0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 47.401 to 43.558, (fuel-used) from 169.366 to 173.209
   goals met: 5 of 7
25. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 5 of 7
26. (turn_to satellite0 planet5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 43.558 to 39.715, (fuel-used) from 173.209 to 177.052
   goals met: 6 of 7
27. (take_image satellite0 planet5 instrument0 thermograph1)
   added: (have_image planet5 thermograph1)
   changed: (data_capacity satellite0) from 865 to 863, (data-stored) from 161 to 163
   goals met: 7 of 7
